; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	image2 - mode
	thermograph1 - mode
	thermograph3 - mode
	image0 - mode
	thermograph4 - mode
	Star1 - direction
	GroundStation5 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation0 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph3)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image2)
	(supports instrument3 thermograph4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Star11)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 thermograph3)
	(have_image Planet8 image2)
	(have_image Planet9 thermograph1)
	(have_image Star10 image0)
	(have_image Star11 thermograph3)
	(have_image Planet12 image2)
))

)

; plan
1. (turn_to satellite2 groundstation0 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite2 planet9 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet9)
   goals met: 0 of 9
5. (take_image satellite2 planet9 instrument4 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite2 planet6 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet6)
   goals met: 1 of 9
7. (turn_to satellite1 star2 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star2)
   goals met: 1 of 9
8. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   goals met: 2 of 9
9. (take_image satellite2 planet6 instrument4 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 3 of 9
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 9
11. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 3 of 9
12. (turn_to satellite1 phenomenon7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 9
13. (take_image satellite1 phenomenon7 instrument3 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 4 of 9
14. (turn_to satellite1 planet12 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet12)
   goals met: 4 of 9
15. (take_image satellite1 planet12 instrument3 image2)
   added: (have_image planet12 image2)
   goals met: 5 of 9
16. (turn_to satellite1 planet8 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet8)
   goals met: 5 of 9
17. (take_image satellite1 planet8 instrument3 image2)
   added: (have_image planet8 image2)
   goals met: 6 of 9
18. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 7 of 9
19. (take_image satellite1 star11 instrument3 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 8 of 9
20. (turn_to satellite2 star10 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star10)
   goals met: 8 of 9
21. (take_image satellite2 star10 instrument4 image0)
   added: (have_image star10 image0)
   goals met: 9 of 9
